# Вывести степени двойки не превосходящие Н 
num = int(input('Введите число: '))
degree = 1
while degree < num:
    print(degree)
    degree *= 2